13_Rails_Fundamentals/notes/music_app/app/controllers/artists_controller.rb

  def create
    @artist = Artist.new(artist_params)
    if @artist.save #meets validation requirements
---
INSERT INTO "artists" ("name", "bio", "image", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Haim"], ["bio", "Three dope sisters"], ["image", ""], ["created_at", 2016-06-09 04:33:42 UTC], ["updated_at", 2016-06-09 04:33:42 UTC]]