15_Rails_Fundamentals /notes/emmett_music/app/controllers/artists_controller.rb

INSERT INTO "artists" ("name", "image_link", "bio", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)
---
  def create
    binding.pry
    @artist = Artist.new(artist_params)
    if @artist.save